var NoomiErrorTip_zh ={
    "0000":"未知错误",
    "0001":"noomi.ini文件配置错误，请参阅官方文档!",
    "0100":"异常配置文件错误",
    "0500":"web配置文件错误，请参阅官方文档!",
    "0600":"缺少redis配置!",

    "1000":"实例配置文件错误，请参阅官方文档!",
    "1001":"实例${0}不存在",
    "1002":"实例'${0}'已存在，不能重复定义",
    "1003":"模块必须定义为类",
    "1004":"模块路径 '${0}' 不存在",
    "1010":"实例方法 '${0}' 不存在",
    "1011":"实例装饰器参数错误",
    

    "2000":"aop配置文件错误，请参阅官方文档!",
    "2001":"pointcut的expressions参数配置错误",
    "2002":"pointcut '${0}' 不存在",
    "2003":"pointcut '${0}' 已存在，不能重复定义",
    "2005":"advice '${0}' 已经在切面中定义",

    "2100":"路由配置文件错误，请参阅官方文档",
    "2101":"路由结果配置错误",
    "2102":"路由访问错误",

    "2200":"过滤器配置文件错误，请参阅官方文档!",

    "2500":"orm文件配置错误，请参阅官方文档!",

    "2600":"redis文件配置错误，请参阅官方文档!",
    "2601":"redis client '${0}' 不存在",

    "2700":"security文件配置错误，请参阅官方文档!",

    "2800":"数据源文件配置错误，请参阅官方文档!",

    "3002":"存入值超过缓存最大值",
    "3010":"键已存在，不能设置为object"
}

var NoomiTip_zh = {
    "0100":"服务启动中...",
    "0101":"redis初始化...",
    "0102":"redis初始化完成！",
    "0103":"web初始化...",
    "0104":"web初始化完成！",
    "0105":"实例工厂初始化...",
    "0106":"实例工厂初始化完成！",
    "0107":"过滤器初始化...",
    "0108":"过滤器初始化完成！",
    "0109":"路由工厂初始化...",
    "0110":"路由工厂初始化完成！",
    "0111":"数据源初始化...",
    "0112":"数据源初始化完成！",
    "0113":"aop初始化...",
    "0114":"aop初始化完成！",
    "0115":"security初始化...",
    "0116":"security初始化完成！",
    "0117":"服务启动成功！",
    "0118":"地址正被使用，重试中..."
}

export{NoomiErrorTip_zh,NoomiTip_zh}